icoFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (9.2473 3.8063 0);

boundaryField
{
    inlet
    {
        type            freestream;
        freestreamValue uniform (9.2473 3.8063 0);
    }

    outlet
    {
    	/*
        type            freestream;
        freestreamValue uniform (9.2473 3.8063 0);
        */
        type			zeroGradient;
    }

    airfoil
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    
    walls
    {
    	//
        type            freestream;
        freestreamValue uniform (9.2473 3.8063 0);
        //
		//type            slip;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
