icoFoam/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0;

vertices
(
    // coordinates of the outer domain
    (-10.5 -0.14886 0)
    (-0.0070797 10.3441 0)
    (0.5 10.3441 0)
    (10.5 10.3441 0)
    (10.5 -0.19962 0)
    (10.5 -10.1778 0)
    (0.5 -10.1778 0)
    (-0.47101 -10.1778 0)
    // Airfoil key coordinates
    (-0.5 -0.14886 0)
    (-0.0070797 0.23323 0)
    (0.5 -0.19962 0)
    (-0.47101 -0.20549 0)
    // ************************************************ // 
    // coordinates of the outer domain
    (-10.5 -0.14886 1)
    (-0.0070797 10.3441 1)
    (0.5 10.3441 1)
    (10.5 10.3441 1)
    (10.5 -0.19962 1)
    (10.5 -10.1778 1)
    (0.5 -10.1778 1)
    (-0.47101 -10.1778 1)
    // Airfoil key coordinates
    (-0.5 -0.14886 1)
    (-0.0070797 0.23323 1)
    (0.5 -0.19962 1)
    (-0.47101 -0.20549 1)
);

blocks
(
    hex (8 9 1 0 20 21 13 12) (40 100 1) simpleGrading (1 50 1)
    hex (9 10 2 1 21 22 14 13) (40 100 1) simpleGrading (1 50 1)
    hex (10 4 3 2 22 16 15 14) (200 100 1) simpleGrading (20 50 1)
    
    hex (11 8 0 7 23 20 12 19) (40 100 1) simpleGrading (1 50 1)
    hex (10 11 7 6 22 23 19 18) (60 100 1) simpleGrading (1 50 1)
    hex (4 10 6 5 16 22 18 17) (200 100 1) simpleGrading (0.05 50 1)
);

edges
(
    // Arc for the front
    arc 0 1 (-6.7518 7.8892 0)
    arc 12 13 (-6.7518 7.8892 1)
    arc 0 7 (-8.1537 -6.5954 0)
    arc 12 19 (-8.1537 -6.5954 1)
    // Define airfoil top-front surface // 
    spline 8 9
    (
        (-0.49663 -0.11849 0)
        (-0.4887 -0.084835 0)
        (-0.47605 -0.049091 0)
        (-0.45856 -0.012353 0)
        (-0.43622 0.024391 0)
        (-0.40913 0.06024 0)
        (-0.37746 0.09437 0)
        (-0.34148 0.12603 0)
        (-0.30154 0.15456 0)
        (-0.25808 0.17937 0)
        (-0.2116 0.19996 0)
        (-0.16264 0.21591 0)
        (-0.11181 0.22691 0)
        (-0.05974 0.23272 0)
    )
    spline 20 21
    (
        (-0.49663 -0.11849 1)
        (-0.4887 -0.084835 1)
        (-0.47605 -0.049091 1)
        (-0.45856 -0.012353 1)
        (-0.43622 0.024391 1)
        (-0.40913 0.06024 1)
        (-0.37746 0.09437 1)
        (-0.34148 0.12603 1)
        (-0.30154 0.15456 1)
        (-0.25808 0.17937 1)
        (-0.2116 0.19996 1)
        (-0.16264 0.21591 1)
        (-0.11181 0.22691 1)
        (-0.05974 0.23272 1)
    )
    // Define airfoil top-back surface // 
    spline 9 10
    (
        (0.045509 0.22842 0)
        (0.097371 0.21835 0)
        (0.14787 0.20321 0)
        (0.19641 0.18327 0)
        (0.24242 0.15891 0)
        (0.28541 0.1306 0)
        (0.32494 0.0989 0)
        (0.36067 0.064471 0)
        (0.39234 0.028062 0)
        (0.41979 -0.0094759 0)
        (0.44296 -0.047184 0)
        (0.46193 -0.08397 0)
        (0.46193 -0.08397 0)
        (0.47684 -0.11857 0)
        (0.48794 -0.14951 0)
        (0.49549 -0.17496 0)
        (0.49961 -0.19264 0)
    )
    spline 21 22
    (
        (0.045509 0.22842 1)
        (0.097371 0.21835 1)
        (0.14787 0.20321 1)
        (0.19641 0.18327 1)
        (0.24242 0.15891 1)
        (0.28541 0.1306 1)
        (0.32494 0.0989 1)
        (0.36067 0.064471 1)
        (0.39234 0.028062 1)
        (0.41979 -0.0094759 1)
        (0.44296 -0.047184 1)
        (0.46193 -0.08397 1)
        (0.46193 -0.08397 1)
        (0.47684 -0.11857 1)
        (0.48794 -0.14951 1)
        (0.49549 -0.17496 1)
        (0.49961 -0.19264 1)
    )
    // Define airfoil bottom-front surface // 
    spline 8 11
    (
        (-0.49903 -0.17453 0)
        (-0.49392 -0.19391 0)
        (-0.4847 -0.20502 0)
    )
    spline 20 23
    (
        (-0.49903 -0.17453 1)
        (-0.49392 -0.19391 1)
        (-0.4847 -0.20502 1)
    )
    // Define airfoil bottom-back surface // 
    spline 11 10
    (
        (-0.45155 -0.19241 0)
        (-0.42325 -0.16252 0)
        (-0.37978 -0.11325 0)
        (-0.31023 -0.045799 0)
        (-0.20089 0.028358 0)
        (-0.046767 0.082012 0)
        (0.13008 0.084114 0)
        (0.28582 0.031286 0)
        (0.39217 -0.046351 0)
        (0.45214 -0.11685 0)
        (0.48196 -0.16583 0)
        (0.49532 -0.19216 0)
    )
    spline 23 22
    (
        (-0.45155 -0.19241 1)
        (-0.42325 -0.16252 1)
        (-0.37978 -0.11325 1)
        (-0.31023 -0.045799 1)
        (-0.20089 0.028358 1)
        (-0.046767 0.082012 1)
        (0.13008 0.084114 1)
        (0.28582 0.031286 1)
        (0.39217 -0.046351 1)
        (0.45214 -0.11685 1)
        (0.48196 -0.16583 1)
        (0.49532 -0.19216 1)
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 13 12)
            (0 7 19 12)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (3 4 16 15)
            (4 5 17 16)
        );
    }
    
    airfoil
    {
        type wall;
        faces
        (
            (8 9 21 20)
            (9 10 22 21)
            (8 11 23 20)
            (11 10 22 23)
        );
    }
    
    walls
    {
        type wall;
        faces
        (
            (1 2 14 13)
            (2 3 15 14)
            (7 6 18 19)
            (6 5 17 18)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
